
RENDER_SIGNAL_NUMBERS = False # вывод номеров сигналов
RENDER_SIGNAL_NUMBERS_RIGHT = True# вывод номеров сигналов справа в слое Сигнатура

# словарь замен на рисунке

CHANGES = {
    'Индикация режима работы (Состояние)': 'Состояние',
    'Индикация режима работы': 'Состояние',
    'Рассогласование при параллельном регулировании': 'Рассогласование при парал. регулировании',
    'Информация об исправности физического устройства':'Информация об исправности физ. устр.',
    'Неисправность модуля n дискретных входов/выходов': 'Неиспр. модуля n дискр. входов/выходов',
    'Статус синхронизации согласно МЭК 61850-9-2': 'Статус синхронизации',
    'Управление аппаратными идентификаторами': 'Упр. аппаратными идентификаторами',
    'Отказ в предоставлении услуги взаимодействия с объектом': 'Отказ в предоставлении услуги',
    'Групповая предупредительная сигнализация': 'Групповая предупр. сигнализации',
    'Необходимость корректировки конфигурации на прием': 'Необх. коррект. конфигурации',
    'Подписка на дублированное GOOSE с симуляцией': 'Подписка на дубл. GOOSE с симуляцией',
    'Неисправность модуля n аналоговых входов': 'Неиспр. модуля n аналог. входов',
    'Число срабатываний реле готовности устройства': 'Число сраб. реле готовности',


}